Andrew-tesler/CecToUsb/CEC/driverlib/MSP430F5xx_6xx/dac12_a.c
/* --COPYRIGHT--,BSD
 * Copyright (c) 2014, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * --/COPYRIGHT--*/
//*****************************************************************************
//
// dac12_a.c - Driver for the dac12_a Module.
//
//*****************************************************************************

//*****************************************************************************
//
//! \addtogroup dac12_a_api
//! @{
//
//*****************************************************************************

#include "inc/hw_regaccess.h"
#include "inc/hw_memmap.h"

#ifdef __MSP430_HAS_DAC12_2__
#include "dac12_a.h"

#include <assert.h>

//*****************************************************************************
//
//! \brief DEPRECATED - Initializes the DAC12_A module with the specified
//! settings.
//!
//! This function initializes the DAC12_A module with the specified settings.
//! Upon successful completion of the initialization of this module the control
//! registers and interrupts of this module are all reset, and the specified
//! variables will be set. Please note, that if conversions are enabled with
//! the enableConversions() function, then disableConversions() must be called
//! before re-initializing the DAC12_A module with this function.
//!
//! \param baseAddress is the base address of the DAC12_A module.
//! \param submoduleSelect decides which DAC12_A sub-module to configure.
//!        Valid values are:
//!        - \b DAC12_A_SUBMODULE_0
//!        - \b DAC12_A_SUBMODULE_1
//! \param outputSelect selects the output pin that the selected DAC12_A module
//!        will output to.
//!        Valid values are:
//!        - \b DAC12_A_OUTPUT_1 [Default]
//!        - \b DAC12_A_OUTPUT_2
//!        \n Modified bits are \b DAC12OPS of \b DAC12_xCTL0 register.
//! \param positiveReferenceVoltage is the upper limit voltage that the data
//!        can be converted in to.
//!        Valid values are:
//!        - \b DAC12_A_VREF_AVCC [Default]
//!        - \b DAC12_A_VREF_INT
//!        - \b DAC12_A_VREF_EXT
//!        \n Modified bits are \b DAC12SREFx of \b DAC12_xCTL0 register.
//! \param outputVoltageMultiplier is the multiplier of the Vout voltage.
//!        Valid values are:
//!        - \b DAC12_A_VREFx1 [Default]
//!        - \b DAC12_A_VREFx2
//!        - \b DAC12_A_VREFx3
//!        \n Modified bits are \b DAC12IR of \b DAC12_xCTL0 register; bits \b
//!        DAC12OG of \b DAC12_xCTL1 register.
//! \param amplifierSetting is the setting of the settling speed and current of
//!        the Vref+ and the Vout buffer.
//!        Valid values are:
//!        - \b DAC12_A_AMP_OFF_PINOUTHIGHZ [Default] - Initialize the DAC12_A
//!           Module with settings, but do not turn it on.
//!        - \b DAC12_A_AMP_OFF_PINOUTLOW - Initialize the DAC12_A Module with
//!           settings, and allow it to take control of the selected output pin
//!           to pull it low (Note: this takes control away port mapping
//!           module).
//!        - \b DAC12_A_AMP_LOWIN_LOWOUT - Select a slow settling speed and
//!           current for Vref+ input buffer and for Vout output buffer.
//!        - \b DAC12_A_AMP_LOWIN_MEDOUT - Select a slow settling speed and
//!           current for Vref+ input buffer and a medium settling speed and
//!           current for Vout output buffer.
//!        - \b DAC12_A_AMP_LOWIN_HIGHOUT - Select a slow settling speed and
//!           current for Vref+ input buffer and a high settling speed and
//!           current for Vout output buffer.
//!        - \b DAC12_A_AMP_MEDIN_MEDOUT - Select a medium settling speed and
//!           current for Vref+ input buffer and for Vout output buffer.
//!        - \b DAC12_A_AMP_MEDIN_HIGHOUT - Select a medium settling speed and
//!           current for Vref+ input buffer and a high settling speed and
//!           current for Vout output buffer.
//!        - \b DAC12_A_AMP_HIGHIN_HIGHOUT - Select a high settling speed and
//!           current for Vref+ input buffer and for Vout output buffer.
//!        \n Modified bits are \b DAC12AMPx of \b DAC12_xCTL0 register.
//! \param conversionTriggerSelect selects the trigger that will start a
//!        conversion.
//!        Valid values are:
//!        - \b DAC12_A_TRIGGER_ENCBYPASS [Default] - Automatically converts
//!           data as soon as it is written into the data buffer. (Note: Do not
//!           use this selection if grouping DAC's).
//!        - \b DAC12_A_TRIGGER_ENC - Requires a call to enableConversions() to
//!           allow a conversion, but starts a conversion as soon as data is
//!           written to the data buffer (Note: with DAC12_A module's grouped,
//!           data has to be set in BOTH DAC12_A data buffers to start a
//!           conversion).
//!        - \b DAC12_A_TRIGGER_TA - Requires a call to enableConversions() to
//!           allow a conversion, and a rising edge of Timer_A's Out1 (TA1) to
//!           start a conversion.
//!        - \b DAC12_A_TRIGGER_TB - Requires a call to enableConversions() to
//!           allow a conversion, and a rising edge of Timer_B's Out2 (TB2) to
//!           start a conversion.
//!        \n Modified bits are \b DAC12LSELx of \b DAC12_xCTL0 register.
//!
//! \return STATUS_SUCCESS or STATUS_FAILURE of the initialization process.
//
//*****************************************************************************
bool DAC12_A_init(uint16_t baseAddress,
                  uint8_t submoduleSelect,
                  uint16_t outputSelect,
                  uint16_t positiveReferenceVoltage,
                  uint16_t outputVoltageMultiplier,
                  uint8_t amplifierSetting,
                  uint16_t conversionTriggerSelect)
{
        DAC12_A_initializeParam param = { 0 };

