Andrew-tesler/CecToUsb/CEC/driverlib/MSP430F5xx_6xx/dac12_a.c
        //Unlock Calibration
        HWREG16(baseAddress + submoduleSelect + OFS_DAC12_0CALCTL) = DAC12PW;

        //Set Calibration Offset
        HWREG16(baseAddress + submoduleSelect + OFS_DAC12_0CALDAT) =
                calibrationOffsetValue;

        //Lock Calibration
        HWREG16(baseAddress + submoduleSelect +
                OFS_DAC12_0CALCTL) = DAC12PW + DAC12LOCK;
}

//*****************************************************************************
//
//! \brief Enables triggers to start conversions.
//!
//! This function is used to allow triggers to start a conversion. Note that
//! this function does not need to be used if DAC12_A_TRIGGER_AUTO was set for
//! the conversionTriggerSelect parameter during initialization. If DAC
//! grouping is enabled, this has to be called for both DAC's.
//!
//! \param baseAddress is the base address of the DAC12_A module.
//! \param submoduleSelect decides which DAC12_A sub-module to configure.
//!        Valid values are:
//!        - \b DAC12_A_SUBMODULE_0
//!        - \b DAC12_A_SUBMODULE_1
//!
//! Modified bits are \b DAC12ENC of \b DAC12_xCTL0 register.
//!
//! \return None
//
//*****************************************************************************
void DAC12_A_enableConversions(uint16_t baseAddress,
                               uint8_t submoduleSelect)
{
        assert(submoduleSelect <= DAC12_A_SUBMODULE_1);

        HWREG16(baseAddress + submoduleSelect + OFS_DAC12_0CTL0) |= DAC12ENC;
}

//*****************************************************************************
//
//! \brief Sets the given data into the buffer to be converted.
//!
//! This function is used to set the given data into the data buffer of the
//! DAC12_A module. The data given should be in the format set (12-bit
//! Unsigned, Right-justified by default). Note if DAC12_A_TRIGGER_AUTO was set
//! for the conversionTriggerSelect during initialization then using this
//! function will set the data and automatically trigger a conversion. If any
//! other trigger was set during initialization, then the
//! DAC12_A_enableConversions() function needs to be called before a conversion
//! can be started. If grouping DAC's and DAC12_A_TRIGGER_ENC was set during
//! initialization, then both data buffers must be set before a conversion will
//! be started.
//!
//! \param baseAddress is the base address of the DAC12_A module.
//! \param submoduleSelect decides which DAC12_A sub-module to configure.
//!        Valid values are:
//!        - \b DAC12_A_SUBMODULE_0
//!        - \b DAC12_A_SUBMODULE_1
//! \param data is the data to be set into the DAC12_A data buffer to be
//!        converted.
//!        \n Modified bits are \b DAC12_DATA of \b DAC12_xDAT register.
//!
//! Modified bits of \b DAC12_xDAT register.
//!
//! \return None
//
//*****************************************************************************
void DAC12_A_setData(uint16_t baseAddress,
                     uint8_t submoduleSelect,
                     uint16_t data)
{
        assert(submoduleSelect <= DAC12_A_SUBMODULE_1);

        HWREG16(baseAddress + submoduleSelect + OFS_DAC12_0DAT) = data;
}

//*****************************************************************************
//
//! \brief Disables triggers to start conversions.
//!
//! This function is used to disallow triggers to start a conversion. Note that
//! this function does not have any affect if DAC12_A_TRIGGER_AUTO was set for
//! the conversionTriggerSelect parameter during initialization.
//!
//! \param baseAddress is the base address of the DAC12_A module.
//! \param submoduleSelect decides which DAC12_A sub-module to configure.
//!        Valid values are:
//!        - \b DAC12_A_SUBMODULE_0
//!        - \b DAC12_A_SUBMODULE_1
//!
//! Modified bits are \b DAC12ENC of \b DAC12_xCTL0 register.
//!
//! \return None
//
//*****************************************************************************
void DAC12_A_disableConversions(uint16_t baseAddress,
                                uint8_t submoduleSelect)
{
        assert(submoduleSelect <= DAC12_A_SUBMODULE_1);

        HWREG16(baseAddress + submoduleSelect + OFS_DAC12_0CTL0) &= ~(DAC12ENC);
}

//*****************************************************************************
//
//! \brief Sets the resolution to be used by the DAC12_A module.
//!
//! This function sets the resolution of the data to be converted.
//!
//! \param baseAddress is the base address of the DAC12_A module.
//! \param submoduleSelect decides which DAC12_A sub-module to configure.
//!        Valid values are:
//!        - \b DAC12_A_SUBMODULE_0
//!        - \b DAC12_A_SUBMODULE_1
//! \param resolutionSelect is the resolution to use for conversions.
//!        Valid values are:
//!        - \b DAC12_A_RESOLUTION_8BIT
//!        - \b DAC12_A_RESOLUTION_12BIT [Default]
//!        \n Modified bits are \b DAC12RES of \b DAC12_xCTL0 register.
//!
//! Modified bits are \b DAC12ENC and \b DAC12RES of \b DAC12_xCTL0 register.
//!
//! \return None
//
//*****************************************************************************
void DAC12_A_setResolution(uint16_t baseAddress,
                           uint8_t submoduleSelect,
                           uint16_t resolutionSelect)
{
        assert(submoduleSelect <= DAC12_A_SUBMODULE_1);
        assert(resolutionSelect <= DAC12_A_RESOLUTION_12BIT);

        //Store the ENC bit status
        uint16_t conversionsEnabledStatus =
                ( HWREG16(baseAddress + OFS_DAC12_0CTL0) & (DAC12ENC) );

        baseAddress += submoduleSelect;         //Add 0x10 to base address IF
                                                //DAC12_A_1 is selected.

        if (DAC12_A_RESOLUTION_8BIT == resolutionSelect)
                HWREG16(baseAddress + OFS_DAC12_0CTL0) |= DAC12RES;
        else if (DAC12_A_RESOLUTION_12BIT == resolutionSelect)
                HWREG16(baseAddress + OFS_DAC12_0CTL0) &= ~(DAC12RES);

        //Restore the ENC bit status
        HWREG16(baseAddress + OFS_DAC12_0CTL0) |= conversionsEnabledStatus;
}

//*****************************************************************************
//
//! \brief Sets the input data format for the DAC12_A module.
//!
//! This function sets the input format for the binary data to be converted.
//!
//! \param baseAddress is the base address of the DAC12_A module.
//! \param submoduleSelect decides which DAC12_A sub-module to configure.
//!        Valid values are:
//!        - \b DAC12_A_SUBMODULE_0
//!        - \b DAC12_A_SUBMODULE_1
//! \param inputJustification is the justification of the data to be converted.
//!        Valid values are:
//!        - \b DAC12_A_JUSTIFICATION_RIGHT [Default]
//!        - \b DAC12_A_JUSTIFICATION_LEFT
//!        \n Modified bits are \b DAC12DFJ of \b DAC12_xCTL1 register.
//! \param inputSign is the sign of the data to be converted.
//!        Valid values are:
//!        - \b DAC12_A_UNSIGNED_BINARY [Default]
//!        - \b DAC12_A_SIGNED_2SCOMPLEMENT
//!        \n Modified bits are \b DAC12DF of \b DAC12_xCTL0 register.
//!
//! \return None
//
//*****************************************************************************
void DAC12_A_setInputDataFormat(uint16_t baseAddress,
                                uint8_t submoduleSelect,
                                uint8_t inputJustification,
                                uint8_t inputSign)
{
        assert(submoduleSelect <= DAC12_A_SUBMODULE_1);
        assert(inputJustification <= DAC12_A_JUSTIFICATION_LEFT);
        assert(inputSign <= DAC12_A_SIGNED_2SCOMPLEMENT);

        //Store the ENC bit status
        uint16_t conversionsEnabledStatus =
                ( HWREG16(baseAddress + OFS_DAC12_0CTL0) & (DAC12ENC) );

        baseAddress += submoduleSelect;         //Add 0x10 to base address IF
                                                //DAC12_A_1 is selected.

