Andrew-tesler/CecToUsb/CEC/driverlib/MSP430F5xx_6xx/dac12_a.c
        if (DAC12_A_JUSTIFICATION_LEFT == inputJustification)
                HWREG16(baseAddress + OFS_DAC12_0CTL1) |= DAC12DFJ;
        else if (DAC12_A_JUSTIFICATION_RIGHT == inputJustification)
                HWREG16(baseAddress + OFS_DAC12_0CTL1) &= ~(DAC12DFJ);

        if (DAC12_A_SIGNED_2SCOMPLEMENT == inputSign)
                HWREG16(baseAddress + OFS_DAC12_0CTL0) |= DAC12DF;
        else if (DAC12_A_UNSIGNED_BINARY == inputSign)
                HWREG16(baseAddress + OFS_DAC12_0CTL0) &= ~(DAC12DF);

        //Restore the ENC bit status
        HWREG16(baseAddress + OFS_DAC12_0CTL0) |= conversionsEnabledStatus;
}

//*****************************************************************************
//
//! \brief Returns the address of the specified DAC12_A data buffer for the DMA
//! module.
//!
//! Returns the address of the specified memory buffer. This can be used in
//! conjunction with the DMA to obtain the data directly from memory.
//!
//! \param baseAddress is the base address of the DAC12_A module.
//! \param submoduleSelect decides which DAC12_A sub-module to configure.
//!        Valid values are:
//!        - \b DAC12_A_SUBMODULE_0
//!        - \b DAC12_A_SUBMODULE_1
//!
//! \return The address of the specified memory buffer
//
//*****************************************************************************
uint32_t DAC12_A_getDataBufferMemoryAddressForDMA(uint16_t baseAddress,
                                                  uint8_t submoduleSelect)
{
        assert(submoduleSelect <= DAC12_A_SUBMODULE_1);
        return baseAddress + submoduleSelect + OFS_DAC12_0DAT;
}


#endif
//*****************************************************************************
//
//! Close the doxygen group for dac12_a_api
//! @}
//
//*****************************************************************************
